["\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tApply to join our team today!\n\nWarehouse Associate Wages of $21.25 to $24.25*/hr. based on shift\n\nIncludes hourly rate plus shift differential pay or key premium pay.\n\nPlease apply with as much open availability as possible! Wage increases approximately every 6 months for 36 months.\n\nWhat does a role as a Warehouse Associate look like?\n\nFollow all safety policies and procedures to ensure a safe working environment for all team members\nAttend safety trainings to learn how to work safely in a fast-paced warehouse environment\nPack, load, and ship items to stores and guests\nEnsure accurate processing of merchandise to our stores and guests\nWork safely, quickly and efficiently to handle freight and move inventory throughout the warehouse\nMaintain a neat, clean, and organized work area\nReport to work on time and complete job tasks as assigned accurately and on time\nEngage in problem solving to support continuous improvement\nMaintains positive and respectful attitude while working independently and in a team environment\n\n\nPlease note job duties may change at any time due to business needs.\n\nJob requirements:\n\nAble to lift and carry merchandise weighing 35-50 lbs. frequently throughout a shift\nAble to lift and carry merchandise weighing up to 60 lbs. occasionally throughout a shift\nStand, walk, push, pull, squat, bend, and reach during shifts\nMaintain positive and respectful attitude while working independently and in a team environment\nAble to accurately use basic math skills (counting, addition, subtraction)\nAble to accurately read labels, tickets, and other product documentation\nAble to operate computer systems or handheld devices with minimal direction after receiving training\nGood written and oral communication skills\nMust be able to understand, speak, and read English with sufficient proficiency to follow safety and other policies, trainings, and instructions.\n\nTarget team members may qualify to enroll in a comprehensive benefits package, subject to terms and conditions of the respective plans and employment eligibility. Target team members are also eligible for the 10% Target discount, plus an additional 20% off a selection of wellness products such as fruits and veggies, healthy food, active wear and tobacco cessation products.\n\n\nAbout us:\n\nAs a Fortune 50 company with more than 350,000 team members worldwide, Target is an iconic brand and one of America's leading retailers. Working at Target means the opportunity to help all families discover the joy of everyday life. Caring for our communities is woven into who we are, and we invest in the places we collectively live, work and play. We prioritize relationships, fuel and develop talent by creating growth opportunities, and succeed as one Target team. At our core, our purpose is ingrained in who we are, what we value, and how we work. It’s how we care, grow, and win together.\n\nTarget Global Supply Chain and Logistics is evolving at an incredible pace. We are constantly reimagining how we get the right products to our guests faster than before, so that no matter how guests shop—in stores or on Target.com—we deliver the convenience and immediate gratification they deserve.\n\nA role in a Distribution Center means being on the front lines of getting products to our guests and stores as quickly as possible to positively impact thousands of fellow team members and Target guests. There’s so much good work being done, from Operations, where process and problem solving drive our results, to Quality Management, which ensures the right products get to the right places on time. We are always striving to support our team to create an ever-evolving business.\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Supply Chain Facility or reach out to Guest Services at 1-800-440-0680 for additional information.\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.\n\n\nQualifications:\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: pay here is good, people are great, good; you can elect benefits, coworkers were lovely and they were great, team members and great\n\t\tCONS: poor management, Long hours, Rude managers, no work life balance, No training\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tThe pay range is $53,700.00 - $96,700.00\n\nPay is based on several factors which vary based on position. These include labor markets and in some instances may include education, work experience and certifications. In addition to your pay, Target cares about and invests in you as a team member, so that you can take care of yourself and your family. Target offers eligible team members and their dependents comprehensive health benefits and programs, which may include medical, vision, dental, life insurance and more, to help you and your family take care of your whole selves. Other benefits for eligible team members include 401(k), employee discount, short term disability, long term disability, paid sick leave, paid national holidays, and paid vacation. Find competitive benefits from financial and education to well-being and beyond at https://corporate.target.com/careers/benefits.\n\nAbout us:\n\nAs a Fortune 50 company with more than 400,000 team members worldwide, Target is an iconic brand and one of America's leading retailers.\n\nWorking at Target means the opportunity to help all families discover the joy of everyday life. Caring for our communities is woven into who we are, and we invest in the places we collectively live, work and play. We prioritize relationships, fuel and develop talent by creating growth opportunities, and succeed as one Target team. At our core, our purpose is ingrained in who we are, what we value, and how we work. It’s how we care, grow, and win together.\n\n\nTarget Global Supply Chain and Logistics is evolving at an incredible pace. We are constantly reimagining how we get the right product to the right guest even better, faster and more cost effectively than before. We are becoming more intelligent, automated and algorithmic in our decision-making, so that no matter how guests shop—in stores or on Target.com—we deliver the convenience and immediate gratification they demand and deserve. We are on a mission to win decisively over any competitor, with a seamless and superior guest service experience unlike any they can offer. Our teams work with the agility our mission requires, and we constantly come together to implement new processes in record time. So we’re looking for exceptional people who are proactive, creative, independent, innovative, risk-savvy and comfortable working in varying degrees of ambiguity. Are you a critical thinker who seeks the root cause and can analyze both qualitatively and quantitatively? Are you a creative problem-solver who simplifies problems, quickly identifies solutions, commits to a plan and then positively influences others to execute it? If so, you will have success on one of our dynamic teams.\n\n\nA role in Inventory Management means applying your specialized and well-informed point of view to what we buy, from whom, how much, and where it needs to go from there. You’ll use the right combination of data and expertise to achieve the best possible product availability through proper inventory positioning. You’ll establish and develop great relationships with our vendors to encourage on-time shipment and delivery to stores and ultimately, guests.\n\nAs an Inventory Analyst, you'll develop business strategies to drive availability and profitable sales. Make an impact by managing and allocating inventory to stores, negotiating and maintain business relationships with the largest vendors in the industry, and formulating in-depth inventory forecasts. It’s your skills that help bring guests what they want, when they want it, whether guests shop our stores or online. We’ll be supporting you with extensive training and robust development to help you grow as a strong Inventory Analyst. This position includes competitive pay and discounts, and flexible scheduling.\n\nCore responsibilities are described within this job description. Job duties may change at any time due to business needs.\n\nAbout you:\n\nFour year degree or equivalent experience\nEntrepreneurial spirit with strong analytical, forecasting, problem solving, and detail orientation\nA performance driven individual who demonstrates strong initiative and has superior leadership skills\nAbility to manage large sets and interpret data\nDemonstrated planning, organization, and decision-making skills\nAbility to communicate clearly and effectively\nComfortable with ambiguity\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.\n\n\nQualifications:\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: pay here is good, people are great, good; you can elect benefits, coworkers were lovely and they were great, team members and great\n\t\tCONS: poor management, Long hours, Rude managers, no work life balance, No training\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tApply to join our team today!\n\nWarehouse Workers Wage of $23.05 to $25.05*/hr based on shift\n\nIncludes hourly rate plus shift differential pay or key premium pay.\n\nPlease apply with as much open availability as possible! Wage increases approximately every 6 months for 36 months\n\nFollow all safety policies and procedures to ensure a safe working environment for all team members\nAttend safety trainings to learn how to work safely in a fast-paced warehouse environment\nPack, load, and ship items to stores and guests\nEnsure accurate processing of merchandise to our stores and guests\nWork safely, quickly and efficiently to handle freight and move inventory throughout the warehouse\nMaintain a neat, clean, and organized work area\nReport to work on time and complete job tasks as assigned accurately and on time\nEngage in problem solving to support continuous improvement\nMaintains positive and respectful attitude while working independently and in a team environment\n\n\nPlease note job duties may change at any time due to business needs.\n\nJob requirements:\n\nAble to lift and carry merchandise weighing 35-50 lbs. frequently throughout a shift\nAble to lift and carry merchandise weighing up to 60 lbs. occasionally throughout a shift\nStand, walk, push, pull, squat, bend, and reach during shifts\nMaintain positive and respectful attitude while working independently and in a team environment\nAble to accurately use basic math skills (counting, addition, subtraction)\nAble to accurately read labels, tickets, and other product documentation\nAble to operate computer systems or handheld devices with minimal direction after receiving training\nGood written and oral communication skills\nAble to be trained on and operate all powered equipment safely (including but not limited to Pallet Rider, Scissor Lift, Sit Down & Standup Forklift), and work at heights of up to 40ft where applicable.\nWork at a height of up to 40 ft on a mezzanine (where applicable)\nMust be able to understand, speak, and read English with sufficient proficiency to follow safety and other policies, trainings, and instructions.\n\nFood Distribution Center only:\n\nAble to work in various temperature-controlled environments including refrigerator and freezer\n\nTarget team members may qualify to enroll in a comprehensive benefits package, subject to terms and conditions of the respective plans and employment eligibility. Target team members are also eligible for the 10% Target discount, plus an additional 20% off a selection of wellness products such as fruits and veggies, healthy food, active wear and tobacco cessation products.\n\n\nAbout us:\n\nAs a Fortune 50 company with more than 350,000 team members worldwide, Target is an iconic brand and one of America's leading retailers. Working at Target means the opportunity to help all families discover the joy of everyday life. Caring for our communities is woven into who we are, and we invest in the places we collectively live, work and play. We prioritize relationships, fuel and develop talent by creating growth opportunities, and succeed as one Target team. At our core, our purpose is ingrained in who we are, what we value, and how we work. It’s how we care, grow, and win together.\n\nTarget Global Supply Chain and Logistics is evolving at an incredible pace. We are constantly reimagining how we get the right products to our guests faster than before, so that no matter how guests shop—in stores or on Target.com—we deliver the convenience and immediate gratification they deserve.\n\nA role in a Supply Chain Facility means being on the front lines of getting products to our guests and stores as quickly as possible to positively impact thousands of fellow team members and Target guests. There’s so much good work being done, from Operations, where process and problem solving drive our results, to Quality Management, which ensures the right products get to the right places on time. We are always striving to support our team to create an ever-evolving business.\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Supply Chain Facility or reach out to Guest Services at 1-800-440-0680 for additional information.\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.\n\n\nQualifications:\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: pay here is good, people are great, good; you can elect benefits, coworkers were lovely and they were great, team members and great\n\t\tCONS: poor management, Long hours, Rude managers, no work life balance, No training\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tThe pay range per hour is $19.23 - $34.62\n\nPay is based on several factors which vary based on position. These include labor markets and in some instances may include education, work experience and certifications. In addition to your pay, Target cares about and invests in you as a team member, so that you can take care of yourself and your family. Target offers eligible team members and their dependents comprehensive health benefits and programs, which may include medical, vision, dental, life insurance and more, to help you and your family take care of your whole selves. Other benefits for eligible team members include 401(k), employee discount, short term disability, long term disability, paid sick leave, paid national holidays, and paid vacation. Find competitive benefits from financial and education to well-being and beyond at https://corporate.target.com/careers/benefits.\n\nAbout us:\n\nAs a Fortune 50 company with more than 400,000 team members worldwide, Target is an iconic brand and one of America's leading retailers.\n\nWorking at Target means the opportunity to help all families discover the joy of everyday life. Caring for our communities is woven into who we are, and we invest in the places we collectively live, work and play. We prioritize relationships, fuel and develop talent by creating growth opportunities, and succeed as one Target team. At our core, our purpose is ingrained in who we are, what we value, and how we work. It’s how we care, grow, and win together.\n\nTarget Global Supply Chain and Logistics is evolving at an incredible pace. We are constantly reimagining how we get the right product to the right guest even better, faster and more cost effectively than before. We are becoming more intelligent, automated and algorithmic in our decision-making, so that no matter how guests shop—in stores or on Target.com—we deliver the convenience and immediate gratification they demand and deserve. We are on a mission to win decisively over any competitor, with a seamless and superior guest service experience unlike any they can offer. Our teams work with the agility our mission requires, and we constantly come together to implement new processes in record time.\n\nA role in a Distribution Center (DC) means being on the front lines of getting product to the guest as fast as possible—a critical differentiator and one of the most essential Logistics functions. You will reach beyond the bounds of your team to partner across the enterprise and find solutions to support the business. Whether it is through focusing on our regional or upstream distribution centers, import warehouses, or fulfillment and flow centers, you will have a chance to positively impact thousands of fellow team members and Target guests worldwide, further differentiating Target from all the rest. There’s so much good work to be done, from Distribution Center Operations, where process and problem-solving drive our results; Quality Management, which influences and maintains our good name in the retail marketplace, or overall Distribution Center Productivity, where we’re always analyzing and recalibrating how to best support our people, process and technology investments to support an ever evolving business.\n\nAs a Computerized Maintenance Management Systems (CMMS) Technician in a DC or Fulfillment Center (FC), you’ll play a key role within the Engineering and Facilities (E&F) department to run efficient maintenance operations and maintain high availability for the building’s important assets.\n\nE&F Team Work Management: The CMMS Technician works with the team and the building to ensure that the E&F team maintains the building’s assets properly, team member labor is scheduled optimally, and the building meets compliance guidelines.\n\nOrganize, plan and schedule the preventative and corrective maintenance work within Maximo for the Engineering and Facilities team members\nCreate and assign work orders to team members at the direction of Engineering & Facilities Operations Managers\nAssist in the prioritization of critical work and building efficient work packages (team member project plans and kitting)\n\nVendor Management: The CMMS Technician works closely with vendor service providers to ensure quality of service. They utilize headquarters partners to aid in resolving problems.\n\nCreates Purchase Orders (POs) with vendors to procure necessary parts and supplies\nValidates and resolves issues with vendor invoices and processes invoices through the EFAA to get goods and services paid for in Target’s financial payment systems\nFollows up with Vendors and Contractors on procured parts and contracted services. Coordinates emergency repairs with external vendors\nOwns the trailer management and maintenance process for Target’s Over The Road (OTR) trailers used to deliver product to the stores (collect Drivers Sheet/check Yard Management System and Security for Red Tags, initiate maintenance work with Amerit Fleet Management Services, update Out of Service report daily)\n\nInventory Management: The CMMS Technician ensures that the building has an accurately stocked storeroom of critical and spare parts, along with operational and building supplies.\n\nManage MRO spare parts inventory, including ordering, receiving, issuing and inventory management responsibilities\nManage critical spare parts by organizing physical storage, managing critical inventory levels, regularly cycle counting inventory levels and ensuring MRO parts availability\n\nData Management: The CMMS tech ensures quality data within Maximo for accurate inventory and labor reporting and appropriate leadership decisions on work order prioritization\n\nAssist in assuring data integrity in the maintenance management system (Maximo) by managing the asset setup, parts, and job plans based upon input from E&F leaders and technicians\nSupport E&F Operations by creating, analyzing, and publishing reports for E&F management and as directed within the maintenance management system\n\nCore responsibilities of this job are described within this job description. Job duties may change at any time due to business needs.\n\nAbout you:\n\nFlexible and able to multi-task between many functions and roles on a daily basis\nAttention to detail and precise record keeping\nAnalytical and problem solving skills - ability to research, identify emerging problems and exceptions, and resolve issues before they become major problems\nAbility to operate effectively independently with minimal guidance and supervision\nAbility to manage key relationships with building stakeholders and external contacts, with demonstrated ability to drive desired results in tense or confrontational situations\nVendor management abilities, with clear and effective oral and written communication skills\nExpert competence with standard office software tools and familiarity with mainstream financial and accounting software\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.\n\n\nQualifications:\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: pay here is good, people are great, good; you can elect benefits, coworkers were lovely and they were great, team members and great\n\t\tCONS: poor management, Long hours, Rude managers, no work life balance, No training\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tApply to join our team today!\n\nWarehouse Workers Wage of $22.60 to $23.60*/hr based on shift *Includes hourly rate plus shift differential pay or premium pay.\n\nPlease apply with as much open availability as possible! Wage increases approximately every 6 months for 36 months.\n\nWhat does a role as a Warehouse Worker look like?\n\nFollow all safety policies and procedures to ensure a safe working environment for all team members\nAttend safety trainings to learn how to work safely in a fast-paced warehouse environment\nPack, load, and ship items to stores and guests\nEnsure accurate processing of merchandise to our stores and guests\nWork safely, quickly and efficiently to handle freight and move inventory throughout the warehouse\nMaintain a neat, clean, and organized work area\nReport to work on time and complete job tasks as assigned accurately and on time\nEngage in problem solving to support continuous improvement\nMaintains positive and respectful attitude while working independently and in a team environment\n\n\nPlease note job duties may change at any time due to business needs.\n\nJob requirements:\n\nAble to lift and carry merchandise weighing 35-50 lbs. frequently throughout a shift\nAble to lift and carry merchandise weighing up to 60 lbs. occasionally throughout a shift\nStand, walk, push, pull, squat, bend, and reach during shifts\nMaintain positive and respectful attitude while working independently and in a team environment\nAble to accurately use basic math skills (counting, addition, subtraction)\nAble to accurately read labels, tickets, and other product documentation\nAble to operate computer systems or handheld devices with minimal direction after receiving training\nGood written and oral communication skills\nAble to be trained on and operate all powered equipment safely (including but not limited to Pallet Rider, Scissor Lift, Sit Down & Standup Forklift), and work at heights of up to 40ft where applicable.\nWork at a height of up to 40 ft on a mezzanine (where applicable)\nMust be able to understand, speak, and read English with sufficient proficiency to follow safety and other policies, trainings, and instructions.\n\nFood Distribution Center only:\n\nAble to work in various temperature-controlled environments including refrigerator and freezer\n\nTarget team members may qualify to enroll in a comprehensive benefits package, subject to terms and conditions of the respective plans and employment eligibility. Target team members are also eligible for the 10% Target discount, plus an additional 20% off a selection of wellness products such as fruits and veggies, healthy food, active wear and tobacco cessation products.\n\n\nAbout us:\n\nAs a Fortune 50 company with more than 350,000 team members worldwide, Target is an iconic brand and one of America's leading retailers. Working at Target means the opportunity to help all families discover the joy of everyday life. Caring for our communities is woven into who we are, and we invest in the places we collectively live, work and play. We prioritize relationships, fuel and develop talent by creating growth opportunities, and succeed as one Target team. At our core, our purpose is ingrained in who we are, what we value, and how we work. It’s how we care, grow, and win together.\n\nTarget Global Supply Chain and Logistics is evolving at an incredible pace. We are constantly reimagining how we get the right products to our guests faster than before, so that no matter how guests shop—in stores or on Target.com—we deliver the convenience and immediate gratification they deserve.\n\nA role in a Supply Chain Facility means being on the front lines of getting products to our guests and stores as quickly as possible to positively impact thousands of fellow team members and Target guests. There’s so much good work being done, from Operations, where process and problem solving drive our results, to Quality Management, which ensures the right products get to the right places on time. We are always striving to support our team to create an ever-evolving business.\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Supply Chain Facility or reach out to Guest Services at 1-800-440-0680 for additional information.\n\nAmericans with Disabilities Act (ADA)\n\nTarget will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.\n\n\nQualifications:\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: pay here is good, people are great, good; you can elect benefits, coworkers were lovely and they were great, team members and great\n\t\tCONS: poor management, Long hours, Rude managers, no work life balance, No training\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tEIN2 HR\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: free food, flexible hours, people there were nice, coworkers nice, Free meal\n\t\tCONS: low pay, bad management, managers can be rude, Low Salary, Breaks are short\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tGérant(e) Géneral(e) / Responsable de restaurant\n\nSalary according to your experience and bonus program\n\n\nWe are looking for candidates with experience and management skills to fill the position of Assistant Manager. We offer several benefits\n\nSalary according to your experience with annual salary increase\nCell phone allowance\nBonus program\nOpportunity for advancement and development\nFlexible work schedule\nFree food\nFree uniform\nPaid training\nGroup insurance\nWork/family balance\n\nWe are looking for candidates who enjoy teamwork, responsibility and challenges. You must also be dynamic and make customer service your priority.\n\n\nBe yourself at work - welcoming people of all ages, backgrounds and cultures - just like the customers who visit our restaurants every day.\n\n\nThe Job\n\nYou probably have an idea of what it means to work with us, but just in case, here are some key tasks that might be part of your job:\n\nInspiring your team, building pride and creating a culture that helps deliver the best fast food experience possible\nMaintain a clean, healthy and safe work environment for customers, colleagues and yourself\nManage and lead a team of managers and team members\nParticipate in local events that have a positive impact on your community\nEnsure compliance with our recognized cleanliness methodology\nGenerate sales and profits, and in turn increase your value, both professionally and financially\n\nYour style and experience\n\nWhile experience working in a restaurant or retail environment as a barista, server, sales associate, cashier, team member or sales representative as a manager can be helpful and appreciated, the most important thing is who you are.\n\n\nYou lead by example and are accountable. You have high expectations and do not hesitate to raise the bar for yourself and your team. When faced with a problem, you are able to assess the situation and resolve the issue with confidence. You put people before profit, recognizing that building a positive culture leads to happier, more engaged employees who deliver a better customer experience.\n\n\n\n\n\nAbout Us\n\nIn 1954, after discovering a small hamburger joint in California, a bold salesman named Ray Kroc would write the very first page of McDonald's history. In 1967, the first\n\n\nMcDonald's Canada opened its doors in Richmond, British Columbia. Since that day, we've grown with our communities, providing quality food at a great value. Today, we are\n\n\nMcDonald's Canada is proud to be one of the world's leading food service companies, offering employment opportunities in both company-owned and independently franchised restaurants.\n\n\n\n\n\nMcDonald's Canada and its franchisees are committed to creating a diverse and inclusive work environment for all. Our workplaces are governed by a long-standing policy of providing fair, equitable and accessible opportunities for all current and potential employees. Accommodations are available upon request during the application process.\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: free food, flexible hours, people there were nice, coworkers nice, Free meal\n\t\tCONS: low pay, bad management, managers can be rude, Low Salary, Breaks are short\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tCompletion of training program required\n\n\nMcDonald's Works for Me.\n\n\nI’m going places. I want a satisfying career with good benefits and great opportunities for advancement. I have a lot to offer, and I want to grow.\n\n\nThe Job for Me – Get a job that inspires your best and moves you forward. Choose your hours. Pursue your education. Build your skills and be yourself.\n\n\nThe Team for Me – Our people want to say YES — to working with energy and purpose, finding new talent, providing coaching and direction, honing their leadership skills, and helping to run a business that serves up delicious food and feel-good moments. Does this sound like you? You’ll fit right in.\n\n\nThe Company for Me – From here, you can go further than you thought possible. Reach your goals and build your future with college tuition assistance, valuable job training, and retirement benefits.\n\n\nRequirements:\n\n\nThe Maintenance Person assists management in achieving and maintaining outstanding interior and exterior restaurant cleanliness and maintaining restaurant equipment. As a member of the Maintenance Team, your restaurant will support you with the tools and training needed to succeed. Must be able to lift up to 50lbs.\n\n\n\n\n\nThe Maintenance Person’s responsibilities may include, but are not limited to:\n\n\nFiltering oil fryers daily\nMaintaining outside grounds\nClean equipment, inside and outside windows, stock rooms and restrooms\nUnload delivery truck 2 times a week\nTake out and empty trash compactor\nChange light bulbs\nClean HVAC/Exhaust units and roof of debris\n\n\nBenefits:\n\nAlong with competitive pay, a Maintenance person at McDonald's is eligible for incredible\n\nbenefits including:\n\nOne of the industry's most competitive wages\n100% college tuition covered with Colorado Technical University\nCollege Tuition Assistance (up to $2,500/yr.)\nBi-annual wage increases for hourly employees\n401k with immediate vesting\nEmployee Discount Program\nA schedule that fits your needs\nFree Meals when working; discount when not working\nPTO (Paid time off)\nHealth Insurance for full-time employees\nHealth and Dental for full-time employees\nStable Employment\nBirthday recognition program\nEmployee of the month Program\nA fantastic and personalized support team\n\n\nThis job posting contains some information about what it is like to work in a McDonald’s restaurant, but it is not a complete job description. People who work in a McDonald’s restaurant perform a number of different tasks every day, and this posting does not list all of the essential functions of this job.\n\n\nThis job posting is for a position in a restaurant owned and operated by an independent franchisee and not McDonald’s USA. This franchisee owns a license to use McDonald’s logos and food products, for example, when running the restaurant. However, this franchisee is a separate company and a separate employer from McDonald’s USA. If you are hired for the job described in this posting, the franchisee will be your employer, not McDonald’s USA. Only the franchisee is responsible for employment matters at the restaurant, including hiring, firing, discipline, supervisions, staffing, and scheduling employees. McDonald’s USA has no control over employment matters at the restaurant. McDonald’s USA will not receive a copy of your employment application and it will have no involvement in any employment decisions, including whether you receive an interview for the job or whether you are hired.\n\n\nBy applying to this position, I understand that I am applying to work at a restaurant that is owned and operated by an independent franchisee, not McDonald’s USA. I understand that this franchisee is a separate company and a separate employer from McDonald’s USA. Any information I provide in this application will be submitted only to the independent franchisee, who is the only company responsible for employment matters at this restaurant. I recognize that the independent franchisee alone will make all decisions concerning employment matters, including hiring, firing, discipline, supervision, staffing and scheduling. By applying for a job at a franchisee operated restaurant, I understand that the information I provide will be forwarded to the franchisee organization in order for that organization to reach out to me and process and evaluate my application. I acknowledge that McDonald’s USA will not receive a copy of my employment application and will have no involvement in any employment decisions regarding me, including whether I receive an interview or whether I am hired to work for the franchisee. I understand that I need to contact the franchise organization for information about its privacy practices.\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: free food, flexible hours, people there were nice, coworkers nice, Free meal\n\t\tCONS: low pay, bad management, managers can be rude, Low Salary, Breaks are short\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tThis job posting is for a position in a restaurant owned and operated by an independent franchisee and not McDonald’s USA. This franchisee owns a license to use McDonald’s logos and food products, for example, when running the restaurant. However, this franchisee is a separate company and a separate employer from McDonald’s USA. If you are hired for the job described in this posting, the franchisee will be your employer, not McDonald’s USA. Only the franchisee is responsible for employment matters at the restaurant, including hiring, firing, discipline, supervisions, staffing, and scheduling employees. McDonald’s USA has no control over employment matters at the restaurant. McDonald’s USA will not receive a copy of your employment application and it will have no involvement in any employment decisions, including whether you receive an interview for the job or whether you are hired.\n\n\n\n\n\nDescription:\n\nMcDonald’s and its independent franchisees care about their employees and that’s why we provide them with an opportunity to learn, grow, and succeed every day. By offering industry-leading education programs and world-class training, we provide opportunities that inspire confidence and foster valuable skills to help employees thrive wherever they are on their journey, whether they stay at McDonald’s or go elsewhere. There is a reason more than 80% of employees are proud to work at McDonald’s and would recommend working at one of our restaurants. A Crew Team Member at McDonald’s is more than just a paycheck – it’s a chance to gain life skills and grow as an individual. And for anyone willing to take advantage of these opportunities…we’re committed to becoming America’s Best First Job.\n\n\nSee a day in the life of a Crew Team Member at McDonald's\n\nhttps://www.youtube.com/watch?v=DiaN61vWY3A&feature=youtu.be\n\n\nRequirements:\n\nWe believe in letting you do you. If you're looking for a part-time job that supports your full-time ambition, you've come to the right place. Crew member opportunities are available practically anytime: breakfast, lunch, late nights, weekends - whatever.\n\n\nYou'll find out that a McDonald's crew job can help you grow with top notch training as well as our Archways to Opportunity education programs that offer high school completion courses, upfront college tuition assistance and English Language courses. McDonald's can take you anywhere, and give you the benefits you need for your life while doing so.\n\n\nSo what does a member of our Crew Team get to do??\n\nConnect with customers to ensure they have a positive experience\nHelp customers order their favorite McDonald's meals\nPrepare all of McDonald’s World Famous food\nPartner with other Crew and Managers to meet daily goals and have fun\nKeep the restaurant looking fantastic\n\n\nAll you'll need is an outstanding attitude, willingness to learn and grow and the capability to excel in a fast-paced, team environment. We'll teach you the rest. For job openings on your schedule - part time or full time - give us a try. You must be 16 years of age or older to work as a Crew Member at McDonald's.\n\n\nAdditional Info:\n\nThis job posting contains some information about what it is like to work in a McDonald’s restaurant, but it is not a complete job description. People who work in a McDonald’s restaurant perform a number of different tasks every day, and this posting does not list all of the essential functions of this job.\n\n\nBy applying to this position, I understand that I am applying to work at a restaurant that is owned and operated by an independent franchisee, not McDonald’s USA. I understand that this franchisee is a separate company and a separate employer from McDonald’s USA. Any information I provide in this application will be submitted only to the independent franchisee, who is the only company responsible for employment matters at this restaurant. I recognize that the independent franchisee alone will make all decisions concerning employment matters, including hiring, firing, discipline, supervision, staffing and scheduling. By applying for a job at a franchisee operated restaurant, I understand that the information I provide will be forwarded to the franchisee organization in order for that organization to reach out to me and process and evaluate my application. I acknowledge that McDonald’s USA will not receive a copy of my employment application and will have no involvement in any employment decisions regarding me, including whether I receive an interview or whether I am hired to work for the franchisee. I understand that I need to contact the franchise organization for information about its privacy practices.\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: free food, flexible hours, people there were nice, coworkers nice, Free meal\n\t\tCONS: low pay, bad management, managers can be rude, Low Salary, Breaks are short\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tDescription:\n\nMcDonald's Works for Me.\n\n\nI’m going places. I want a satisfying career with good benefits and great opportunities for advancement. I have a lot to offer and I want to grow.\n\n\nThe Job for Me – Get a job that inspires your best and moves you forward. Choose your hours. Pursue your education. Build your skills and be yourself.\n\n\nThe Team for Me – Our people want to say YES — to working with energy and purpose, finding new talent, providing coaching and direction, honing their leadership skills, and helping to run a business that serves up delicious food and feel-good moments. Does this sound like you? You’ll fit right in.\n\n\nThe Company for Me – From here, you can go further than you thought possible. Reach your goals and build your future with college tuition assistance, valuable job training, and retirement benefits.\n\n\nLet’s talk. Make your move.\n\n\nRequirements:\n\nThe Maintenance Person assists management in achieving and maintaining outstanding interior and exterior restaurant cleanliness and maintaining restaurant equipment. As a member of the Maintenance Team, your restaurant will support you with the tools and training needed to succeed.\n\n\nThe Maintenance Person’s responsibilities may include, but are not limited to:\n\nFiltering oil fryers daily\nMaintaining outside grounds\nClean equipment, inside and outside windows, stock rooms and restrooms\nUnload delivery truck 2 times a week\nTake out and empty trash compactor\nChange light bulbs\nClean HVAC/Exhaust units and roof of debris\n\n\nAdditional Info:\n\nAlong with competitive pay, a Maintenance Person at a McDonald’s Corporate owned restaurant is eligible for incredible benefits including:\n\n15-25 days paid vacation\n10 paid holidays and 8-week sabbatical every 10 years\nEducation through Archways to Opportunity including opportunities to earn a High School degree, college tuition assistance and English classes as a second language\nMedical, dental and vision coverage\nPre-tax flexible spending accounts\nShort- and Long-Term Disability, life and accident insurance\nPaid Leaves of Absence\nService awards\nEmployee Resource Connection\nAdoption Assistance\nMatching gifts program\n\nBenefits:\n\nFree/Discounted Food\n\nFree Uniform\n\nFlexible Schedule\n\nNational Employee Food Discount (30% off)\n\nArchways to Opportunity: college tuition assistant, English under the Arch, scholarship, free high school diploma.\n\nIncentive program rewards good performance, good attendance and more.....\n\nReferral Program\n\nEmployee of the Month Program\n\n\nThis job posting contains some information about what it is like to work in a McDonald’s restaurant, but it is not a complete job description. People who work in a McDonald’s restaurant perform a number of different tasks every day, and this posting does not list all of the essential functions of this job.\n\n\nBy applying to this position, I understand that I am applying to work at a restaurant that is owned and operated by an independent franchisee, not McDonald’s USA. I understand that this franchisee is a separate company and a separate employer from McDonald’s USA. Any information I provide in this application will be submitted only to the independent franchisee, who is the only company responsible for employment matters at this restaurant. I recognize that the independent franchisee alone will make all decisions concerning employment matters, including hiring, firing, discipline, supervision, staffing and scheduling. By applying for a job at a franchisee operated restaurant, I understand that the information I provide will be forwarded to the franchisee organization in order for that organization to reach out to me and process and evaluate my application. I acknowledge that McDonald’s USA will not receive a copy of my employment application and will have no involvement in any employment decisions regarding me, including whether I receive an interview or whether I am hired to work for the franchisee. I understand that I need to contact the franchise organization for information about its privacy practices.\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: free food, flexible hours, people there were nice, coworkers nice, Free meal\n\t\tCONS: low pay, bad management, managers can be rude, Low Salary, Breaks are short\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tInfosys is seeking a Test Lead with experience in JAVA/Selenium/BDD.\n\nAs a QA Test Lead, you will act as a validation and quality assurance professional across the different stages of the Testing lifecycle. You will coordinate with stakeholders and conduct test workshop to convert the requirement specifications into test requirements and create test strategy. You will create test assurance plans, strategy and identify the components for failover, system recovery and collaborate with all the teams to meet our clients’ business needs. You will also be required to implement both TDD and BDD.\n\nRequired Qualifications:\nBachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.\n4 years of IT Experience\nCandidate must be located within commuting distance of Tampa, FL be willing to relocate to the area on Day1\nAt least 4 years of working experience in QA Testing\nStrong communication skills\nPreferred Qualification:\n4+ years of automated testing using the following – Selenium webdriver, Test NG, Java\n4+ years of experience in Java programming for BDD cucumber mobile framework\nAsses the current state of testing at the framework level and identify gaps to achieve the target state\nEnsure that design for automated tests includes modularization for code reusability, parameterization for data driven capability, Balance between clarity and efficiency\nProvide consultation, share expert opinion and provide guidance from an automation framework architecture standpoint\nHands-On automated testing using any of the following: Selenium (must have)\nSolid background writing and executing test automation to ensure the delivery of a high quality user experience\nExpertise in developing BDD automation framework with Cucumber, Gherkin\nExpert experience in bitbucket/GitHub or similar code hosting platform\nExperience in Continuous integration / continuous build framework\nThe job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email or face to face. Travel may be required as per the job requirements.\n\nAbout Us\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.\n\nInfosys is an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, spouse of protected veteran, or disability.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, Work culture is good, Good training, good campus, facilities are good\n\t\tCONS: Less salary, No salary hikes, Poor management, Less pay, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tProvider Data Management\nProcess Associate\nPhoenix, AZ\n\nIn the role of process associate, you will execute transactions as per prescribed guidelines and timelines, reviews and validates the inputs from the other team members, support your manager in training activities, daily operations reviews and help in escalation resolution with the objective to meet service level agreement targets for the specific process within the guidelines, policies and norms of Infosys.\n\nIn this role, you will create content for internal and external audiences. The content will include process documentation and internal communications.\nYour responsibilities will include but are not limited to:\n\nDevelop a quality management plan relating to client needs and Infosys processes\nConduct client process audits, identify gaps in execution and provide feedback to agents\nPerform transaction monitoring and provide feedback\nIdentify opportunities for process improvements\nIdentify and report operational risks\n\nLocation for this position is Phoenix, AZ\n\nQualifications\nBasic\nHigh School Diploma or GED Equivalent\n6 months of experience in the job description\n\nPreferred\n\nSix months to 1 year of overall experience\nExperience in BPO would be an advantage but not mandatory\nAble to use MS-office for necessary tracking of work completed and creating reports from the same\nAbility to prioritize and complete multiple tasks in a fast-paced, changing environment\nThe primary scope of work would be data entry of provider demographic details in the client platform with high accuracy\n\nNote: Applicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa (H1B or otherwise).\nThe job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email or face to face.\n\nAbout Us\n\nInfosys BPM Limited, a wholly owned subsidiary of Infosys Limited (NYSE: INFY), provides end-to-end transformative business process management (BPM) services for its clients across the globe. The company’s integrated IT and BPM solutions approach enables it to unlock business value across industries and service lines, and address business challenges for its clients. Utilizing innovative business excellence frameworks, ongoing productivity improvements, process reengineering, automation, and cutting-edge technology platforms, Infosys BPM enables its clients to achieve their cost reduction objectives, improve process efficiencies, enhance effectiveness, and deliver superior customer experience.\n\nInfosys BPM has 42 delivery centers in 16 countries spread across 5 continents, with 58,745 employees from 124 nationalities, as of March, 2023.\n\nThe company has been consistently ranked among the leading BPM companies globally and has received over 60 awards and recognitions in the last 5 years, from key industry bodies and associations like the Outsourcing Center, SSON, and GSA, among others. Infosys BPM also has very robust people practices, as substantiated by the various HR-specific awards it has won over the years. The company has consistently been ranked among the top employers of choice, on the basis of its industry leading HR best practices. The company’s senior leaders contribute widely to industry forums as BPM strategists.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, Work culture is good, Good training, good campus, facilities are good\n\t\tCONS: Less salary, No salary hikes, Poor management, Less pay, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tProcess Associate\nLocation: Reno, NV\n\nIn the role of process associate, you will execute transactions as per prescribed guidelines and timelines and follow all predefined procedures to meet SLA target and to ensure that the performance parameters are met.\n\nYou will be responsible for keeping accurate records of business activities including detailed information on Agreements/Orders, exceptions and queries, outstanding problems and executive approvals as outlined by Legal & Finance. A Process Associate must accept and deal with customer communication for agreed languages.\n\nWe are seeking dynamic individuals to join our team as Process Associate. The successful candidates will specialize in managing validations and auditing the orders and agreements. This role would suit driven individuals who would enjoy working as part of a Global team and would like a clear career path ahead of them. Our team members gain Global exposure, paid training, career growth opportunity and unlimited lattes and cappuccinos. Oh, and I almost forgot to mention paid overtime.\n\nResponsibilities may include but are not limited to:\nReview and validate documents, processing bills, analysis of data.\nRespond to complaints/queries on mail and interact with vendors for order management\nSupport your team in daily operations reviews and help in escalation resolution with the objective to meet service level agreement targets for the specific process within the guidelines, policies, and norms of Infosys\nDeliver on the new process/approach to meet client and internal goals\nAdhere to Service Level Agreement compliance and Process compliance standards\nServe as backup support to others on the on the team\nSuggest more efficient ways for processing of work; learn new areas for possible future ownership\nQualifications:\nBasic:\nHigh School diploma or GED equivalent\n6 months of experience in the job description\nPreferred:\n1 year of previous experience in a similar data entry or administrative role\nProficiency in Microsoft tools such as MS Word, MS Excel, MS PowerPoint, MS Outlook, and other business systems\nAnalytical and problem-solving skills\nAbility to work effectively as part of a team\nAbility to provide a strong focus on customer satisfaction\nAdministration & organizational skills\nWritten and oral communication skills\nWillingness to learn new processes and tasks\nFlexible schedule (overtime eligible)\nNote: Applicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa (H1B or otherwise).\n\nThe job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face.\nNote: Applicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa (H1B or otherwise).\n\nThe job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face.\n\nWork Location:\nThis role is based out of Reno, NV and will be working out of an office.\n\nAbout Us\n\nInfosys BPM Limited, a wholly owned subsidiary of Infosys Limited (NYSE: INFY), provides end-to-end transformative business process management (BPM) services for its clients across the globe. The company’s integrated IT and BPM solutions approach enables it to unlock business value across industries and service lines, and address business challenges for its clients. Utilizing innovative business excellence frameworks, ongoing productivity improvements, process reengineering, automation, and cutting-edge technology platforms, Infosys BPM enables its clients to achieve their cost reduction objectives, improve process efficiencies, enhance effectiveness, and deliver superior customer experience.\nInfosys BPM has 43 delivery centers in 16 countries spread across 5 continents, with 58,745 employees from 124 nationalities, as of March, 2023.\nThe company has been consistently ranked among the leading BPM companies globally and has received over 60 awards and recognitions in the last 5 years, from key industry bodies and associations like the Outsourcing Center, SSON, and GSA, among others. Infosys BPM also has very robust people practices, as substantiated by the various HR-specific awards it has won over the years. The company has consistently been ranked among the top employers of choice, on the basis of its industry leading HR best practices. The company’s senior leaders contribute widely to industry forums as BPM strategists.\n\nEOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/National Origin\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, Work culture is good, Good training, good campus, facilities are good\n\t\tCONS: Less salary, No salary hikes, Poor management, Less pay, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tJob Description\nThis position is responsible for providing exceptional customer service while maximizing productivity within our call center in such a manner that supports the mission, values and standards of the Company and focused on client satisfaction. Primary responsibilities include direct phone-based customer interaction to answer and resolve a wide variety of inquiries related to travel insurance products. Evenings, weekend, and holiday availability is required. This position reports to the Customer Service Supervisor under the direction of the Customer Service Manager.\nPrincipal Duties and Responsibilities:\nAnswers incoming calls from queue in a professional and courteous manner\nAssists internal and external customers via email\nService internal and external customers via customer chat channel\nEnsure that customer requests are fulfilled, and questions are answered in an accurate, knowledgeable, and efficient manner\nTransfers callers to the appropriate departments\nEscalate calls to supervisor as warranted\nEnter appropriate comments and notes within policy database\nProactively recommend and upsell appropriate products based upon customer needs or direction from supervisor\nTakes a proactive approach to enhance product knowledge when not on a call, including but not exclusive to submitting topics for department knowledge base, studying coverage and procedural documents, and visiting competitor and partner websites\nFoster a team environment by creating and maintaining a positive relationship with peers, customers and business partners\nConsistently meet or exceed performance standards outlined in the Customer Service Department career path\n\nBasic Qualifications\nHigh School Diploma or GED Equivalent\nMinimum of 1 year in Customer Service Role\n\n\nPreferred Qualifications\nExcellent verbal and written communication\nAbility to interact with customers in a professional manner while having an upbeat and friendly demeanor\nExcellent computer skills including experience with Microsoft Office products\nAbility to work independently at a quick pace and with a high degree of accuracy\n\nAbout Us\nInfosys BPM Limited, a wholly owned subsidiary of Infosys Limited (NYSE: INFY), provides end-to-end transformative business process management (BPM) services for its clients across the globe. The company’s integrated IT and BPM solutions approach enables it to unlock business value across industries and service lines, and address business challenges for its clients. Utilizing innovative business excellence frameworks, ongoing productivity improvements, process reengineering, automation, and cutting-edge technology platforms, Infosys BPM enables its clients to achieve their cost reduction objectives, improve process efficiencies, enhance effectiveness, and deliver superior customer experience.\n\nInfosys BPM has 43 delivery centers in 16 countries spread across 5 continents, with 58,745 employees from 124 nationalities, as of March, 2023.\n\nThe company has been consistently ranked among the leading BPM companies globally and has received over 60 awards and recognitions in the last 5 years, from key industry bodies and associations like the Outsourcing Center, SSON, and GSA, among others. Infosys BPM also has very robust people practices, as substantiated by the various HR-specific awards it has won over the years. The company has consistently been ranked among the top employers of choice, on the basis of its industry leading HR best practices. The company’s senior leaders contribute widely to industry forums as BPM strategists.\nEOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/Nationality\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, Work culture is good, Good training, good campus, facilities are good\n\t\tCONS: Less salary, No salary hikes, Poor management, Less pay, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tJob Description\n\nPrincipal Duties and Responsibilities:\nYour responsibilities may include but are not limited to:\n\nFollows all predefined guidelines and timelines such as verifying documents, analysis of data and deliver required information to client on a timely manner in order to meet SLA target and to ensure that the performance parameters are met\nAnswer incoming phone calls from health care providers (i.e. physician offices, clinics) and identify the type of assistance the provider needs (EG. benefit and eligibility, billing and payments, authorizations for treatment, explanation of benefits)\nFocus on resolving issues on the first call, navigating through complex computer systems to identify the status of the issue and provide appropriate response to caller\nEffectively executes calls of the client’s customers, resolves query/issue as per deliverable outlined, maintains voice quality as per standard agreed, handles repetitive calls and strives for target maximization in order to meet quality standards\nHandles individual cases that need re-work in order to ensure high customer satisfaction/NPS score from the end user\nDelivers on the new process/approach in order to meet client and internal goals\nPerforms stand-alone activities or high volume transactions such as customer calls, emails, chats, requests/orders including cancelling, adding, and modifying per customer requirements in order to ensure SLA adherence, customer satisfaction, quality and compliance\n\nQualifications\n\nBasic\n\nHigh School Diploma or GED Equivalent\n1-year relevant job experience\nPreferred\n\nExperience in customer support or data entry\nAbility to work with in Microsoft Office\nProfessional written and verbal communication\nAnalytical skills\nFully bilingual (Spanish and English)\n\nAbout Us\nInfosys BPM Limited, a wholly owned subsidiary of Infosys Limited (NYSE: INFY), provides end-to-end transformative business process management (BPM) services for its clients across the globe. The company’s integrated IT and BPM solutions approach enables it to unlock business value across industries and service lines, and address business challenges for its clients. Utilizing innovative business excellence frameworks, ongoing productivity improvements, process reengineering, automation, and cutting-edge technology platforms, Infosys BPM enables its clients to achieve their cost reduction objectives, improve process efficiencies, enhance effectiveness, and deliver superior customer experience.\nInfosys BPM has 43 delivery centers in 16 countries spread across 5 continents, with 58,745 employees from 124 nationalities, as of March, 2023.\nThe company has been consistently ranked among the leading BPM companies globally and has received over 60 awards and recognitions in the last 5 years, from key industry bodies and associations like the Outsourcing Center, SSON, and GSA, among others. Infosys BPM also has very robust people practices, as substantiated by the various HR-specific awards it has won over the years. The company has consistently been ranked among the top employers of choice, on the basis of its industry leading HR best practices. The company’s senior leaders contribute widely to industry forums as BPM strategists.\nEOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/Nationality\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, Work culture is good, Good training, good campus, facilities are good\n\t\tCONS: Less salary, No salary hikes, Poor management, Less pay, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tAccenture Federal Services – Professional Development Internship Program\n\n\nWe are:\n\nA technology company headquartered in Arlington, Virginia, dedicated to making a difference through digital transformations. We’re real, creative people who 'bring the awesome'. It’s literally written on our office walls. We’re taking proven technology practices from commercial businesses and applying it to federal agencies. This way, our government can operate in a way that meets our 21st century expectations. Ready to learn as much as you can? Join us. We'll give you opportunities from training sessions to mentors to keep your tech smarts sharp.\n\n\nYou are:\n\nA team player with an entrepreneurial mind, envisioning how to use technology to make the world a better place. You see the potential for technology everywhere, from solving problems to capturing new opportunities. And you are ready to put that kind of innovative thinking to work. You see the art of the possible and have the drive and critical thinking skills to make it happen.\n\nEmerging technologies and next-generation IT excite you –– and you’re ready to put that passion to work across many different types of client projects.\n\n\nWe’re hiring for the following positions:\n\nTechnology Analyst - You design technology solutions that align with business strategies and goals. From analysis to implementation, you work alongside our clients designing and developing technology solutions.\n\n\nThe work:\n\nKick-start your career in our Technology Development Program to learn the latest technical skills\n\nWork side-by-side with a diverse group of people across many different technologies to design and develop new technology product features\n\nBridge the gap between technology and business by using your analytical expertise\n\nManage deadlines diligently, working with your team to achieve project milestones\n\nExperiment and be an early adopter of emerging technologies and next-generation IT\n\nLeverage cool engineering frameworks and methods, such as Agile and DevOps, to build new solutions faster\n\nSupport project management by reporting issues, risks, and status, and by assisting with financial activities as needed\n\nKeep up with global, economic, technology and social trends to create tailored solutions\n\nRecommend and discuss changes to improve solutions\n\n\n\n\nBasic Qualifications:\n\nCurrently enrolled in degree program\n\nThis role requires US Citizenship with no dual US Citizenship exceptions\n\nPreferred Qualifications:\n\nDegree Type/Major: Computer Science, Information Systems, Computer Engineering, or Engineering discipline\n\nDemonstrate experience with multiple programming languages, modern frameworks, architectures, databases, and cloud platforms\n\nHave a concentration in Artificial Intelligence, Blockchain and/or Machine Learning\n\nCompensation for our Development Programs varies depending on a wide array of factors including but not limited to the specific office location, development program, role and skill set. As required by local law, Accenture Federal Services provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below and information on benefits offered is here.\n\n\nRole Location: Range of Starting Pay for role:\n\nCalifornia: $59,900 - $94,700\n\nColorado: $59,900 - $81,800\n\nNew York City: $69,300 - $94,700\n\nWashington: $63,900 - $87,100\n\n\nWhat We Believe\n\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n\n\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\n\nEqual Employment Opportunity Statement\n\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\n\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\n\n\nRequesting An Accommodation\n\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\n\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\n\nOther Employment Statements\n\n\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, work culture is good, people are great, Benefits are good, culture and perks of being in a company seems good\n\t\tCONS: low salary, management are very very poor, Extended working hours, long hours, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tACCENTURE's Flexible Workforce solves clients’ toughest challenges by providing cross-industry expertise, unmatched innovation, World-class tech and talent. We help bring it all together to deliver tangible business outcomes for our clients with contractors and our extended workforce opportunities. Accenture is consistently recognized on FORTUNE’s 100 Best Companies to Work for and Diversity Inc’s Top 50 Companies for Diversity lists. And that's just the beginning. Now is the perfect time for you to consider opportunities through our Flexible Workforce.\n\nWhat's In It For You:\nCollaborate with a diverse network of people\nActively deliver innovative solutions for Accenture's clients\nApply your skills and experience to help drive business transformation\nWork locally or remotely, significantly reducing or eliminating the demands to travel\nProject Description:\nEven technology companies need tech support. You know, someone to keep things running smoothly - both behind-the-scenes and customer facing. This is where you come in. The backbone to our backbone. LTO is looking for a motivated Contractor to provide high value services to our customers adding value and efficiency in their use of technology. We find the right solutions and enable high performance.\n\nAt Accenture we’ve created amazing spaces called Solution Bars where customers can find a team of IT support advisors - a one stop shop to find the answers you are looking for. We envision, advise, fix, train, create, innovate, and collaborate with hyper speed and scale. The driving force behind it all? Our people.\n\nResponsibilities:\nOur team environment consists of a walk-up Tech Bar and virtual support across North America offering high value services.\nWorking with a team of motivated and engaged super technologists, driving high performance and morale.\nSupport in areas of incidents, and high value services with a focus on customer experience\nBuilding authentic, positive, trust-based relationships with all key-stakeholders\nBecome the Technology Services customer champion in all respects to deliver customer excellence.\nProactively seeking opportunities to meet or exceed the quality and consistency of service delivery for our customers, escalating only when necessary.\nSupporting projects and initiatives that impact large groups of people across the US.\nYour journey at Accenture is premised on continually learning and growing - technically, personally and professionally.\nEmbracing, supporting and cultivating the diversity that knits our teams together.\nWe are powered by our diversity.\nBasic Qualifications:\nYou are positive, engaging with a strong passion for customer and technology excellence\nYou love innovation, driving change and a challenge\nYou are familiar with Windows environment – Apple experience is a plus\nYou have a passion and experience collaborating and relationship building\n85% Windows based machines including Dell, HP and Lenovo\nMS Suite of apps including O365, Teams, SharePoint, Outlook\nHeavy Microsoft support in this location\nSurface hubs, Cyviz, Microsoft Teams\nRooms\nServiceNow ticket tracking\n\nKeywords: Windows Support, Customer Service\n\nWhat We Believe\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\nEqual Employment Opportunity Statement\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. Our rich diversity makes us more innovative, more competitive and more creative, which helps us better serve our clients and our communities.\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\nPlease be aware that Accenture requires all contractors to be fully vaccinated as a condition of placement, abiding by applicable federal, state & local laws. Requests for medical or religious accommodation to this vaccination requirement will be reviewed if an offer is extended by the supplier.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement\nRequesting An Accommodation for this specific opportunity\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are going to be placed on an Accenture project and require accommodation to perform the essential functions of the opportunity, you will be asked to participate in our reasonable accommodation process as it relates to the initial interview process and for ongoing support, you will need to consult your supplier as their reasonable accommodation process if an offer is extended. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\nOther Employment Statements\n\nApplicants for placement consideration in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, work culture is good, people are great, Benefits are good, culture and perks of being in a company seems good\n\t\tCONS: low salary, management are very very poor, Extended working hours, long hours, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tACCENTURE's Flexible Workforce solves clients’ toughest challenges by providing cross-industry expertise, unmatched innovation, World-class tech and talent. We help bring it all together to deliver tangible business outcomes for our clients with contractors and our extended workforce opportunities. Accenture is consistently recognized on FORTUNE’s 100 Best Companies to Work for and Diversity Inc’s Top 50 Companies for Diversity lists. And that's just the beginning. Now is the perfect time for you to consider opportunities through our Flexible Workforce.\n\nWhat's In It For You:\nCollaborate with a diverse network of people\nActively deliver innovative solutions for Accenture's clients\nApply your skills and experience to help drive business transformation\nWork locally or remotely, significantly reducing or eliminating the demands to travel\nResponsibilities:\nEstimate the test effort for the user stories\nCreate test scenarios and test cases\nCreate test data (jointly with the test data management team)\nExecute test cases, Log defects, Verify defect fixes and Capture test and defect metrics\nProvide test inputs during the sprint baseline meetings\nPerform quality checks for Accepted user stories (internal QA before the Demo)\nPerform the demo of the testing results with the CSS business partners\nBasic Qualifications:\nQA Analyst or Tester participates in requirement review meeting, test strategy development, test case creation, test script development, test execution, defect tracking and reporting.\nMust have experience with SQL\nMust have experience with reviewing the user stories during the Amigo (CSS requirement review meeting) reviews\nMust have experience with testing Web Services, DW/ETL, JAVA backend applications\nKnowledge of test methodologies and processes\nProficiency in test/defect management tools: HP ALM and Rally\nKeywords: QA Tester, Quality Analyst, Quality Analyst Tester\n\nWhat We Believe\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\nEqual Employment Opportunity Statement\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. Our rich diversity makes us more innovative, more competitive and more creative, which helps us better serve our clients and our communities.\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement\nPlease be aware that Accenture requires all contractors to be fully vaccinated as a condition of placement, abiding by applicable federal, state & local laws. Requests for medical or religious accommodation to this vaccination requirement will be reviewed if an offer is extended by the supplier.\n\nRequesting An Accommodation for this specific opportunity\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are going to be placed on an Accenture project and require accommodation to perform the essential functions of the opportunity, you will be asked to participate in our reasonable accommodation process as it relates to the initial interview process and for ongoing support, you will need to consult your supplier as their reasonable accommodation process if an offer is extended. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\nOther Employment Statements\n\nApplicants for placement consideration in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, work culture is good, people are great, Benefits are good, culture and perks of being in a company seems good\n\t\tCONS: low salary, management are very very poor, Extended working hours, long hours, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tACCENTURE's Flexible Workforce solves clients’ toughest challenges by providing cross-industry expertise, unmatched innovation, World-class tech and talent. We help bring it all together to deliver tangible business outcomes for our clients with contractors and our extended workforce opportunities. Accenture is consistently recognized on FORTUNE’s 100 Best Companies to Work for and Diversity Inc’s Top 50 Companies for Diversity lists. And that's just the beginning. Now is the perfect time for you to consider opportunities through our Flexible Workforce.\n\nWhat's In It for You:\nCollaborate with a diverse network of people\nActively deliver innovative solutions for Accenture's clients\nApply your skills and experience to help drive business transformation\nWork locally or remotely, significantly reducing or eliminating the demands to travel\nProject Description:\n\nProvide location support for the team and office. Independently complete assigned non-routine tasks to meet goals and work effectively in a team environment. Serve as the primary support for office, and act as a liaison between the executives and their organization. Must reside in Chicago, Illinois.\n\nPlease Note This Is An IN-OFFICE Position\n\nResponsibilities:\nGreet and direct employees and visitors, answer general inquiries and resolve issues/concerns.\nMust reside in Chicago, Illinois.\nProcess space reservation requests (assign and confirm space and equipment) and ensure optimal workspace occupancy.\nPerform administrative duties according to location guidelines.\nAct as a point of contact for external vendors.\nCarry out instructions for security, fire, health and safety and maintain records.\nWork in a group to achieve the appropriate level of external, and internal customer satisfaction.\nProvide backup support for Facilities/Services.\nStrong focus on hospitality and customer service.\nComfortable assisting with any workplace position and showcasing a willingness to help wherever needed.\nConduct quality assurance checks to ensure service standards are being met.\nFull availability to work 8 hours, Monday-Friday, 8am-5pm and occasionally outside of these hours.\nBasic Qualifications:\n2+ years of customer service experience\nMust reside in Chicago, Illinois\nHigh School Diploma\nAbility to work with highly confidential material and maintain confidentiality\n\nPassionate about hospitality /customer service\nDemonstrated teamwork and collaboration\nExcellent interpersonal skills\nStrong communication skills (written and oral)\nStrong organizational, multi-tasking, and time-management skills\nHighly responsive, flexible, and adaptable\nAbility to use computers, Microsoft Office, and other software systems\n\nBonus Points If You Have:\nGood aptitude for technology and learning new technology\nBachelor's degree\n\nKeywords: Front Desk receptionist, customer service, administrative assistant\n\nWhat We Believe\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\nEqual Employment Opportunity Statement\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. Our rich diversity makes us more innovative, more competitive and more creative, which helps us better serve our clients and our communities.\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement\n\n\nRequesting An Accommodation for this specific opportunity\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are going to be placed on an Accenture project and require accommodation to perform the essential functions of the opportunity, you will be asked to participate in our reasonable accommodation process as it relates to the initial interview process and for ongoing support, you will need to consult your supplier as their reasonable accommodation process if an offer is extended. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\nOther Employment Statements\n\nApplicants for placement consideration in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, work culture is good, people are great, Benefits are good, culture and perks of being in a company seems good\n\t\tCONS: low salary, management are very very poor, Extended working hours, long hours, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tWe are:\n\nAccenture Federal Services, helping our federal clients tackle their toughest challenges while unleashing their fullest potential…and then some. What makes our approach so unique? Operating from the nation’s capital, we bring together commercial innovation and leading-edge technologies to deliver an integrated and interactive experience that far exceeds expectations. How? Our passion meets purpose! Through our diverse culture and inclusive thinking, we embrace our employees' ideas taking them from concept to practical solutions. We keep our tech smarts sharp by providing abundant training and certification opportunities. Are you ready to learn and grow in a career, while making a difference?\n\nThe work:\nData Analyst for an enterprise big data and analytics platform that utilizes emerging technology to ingest data in real time at extreme volumes and high velocity. You will be part of a highly collaborative and growing network of data experts, who are taking on today’s biggest, most complex business challenges using the latest data technologies and partnering with the largest cloud providers to support data mining, data analysis, and data visualization. You will have experience with Excel and SQL. You will be detail-oriented with strong analytical and problem-solving skills, Communication Skills, and a team player.\n\n\n\n\nHere's what you need:\n\n1+ years of experience with Data analysis conducting QA queries\n\nExperience with gathering and processing business requirements for the purpose of translating data\n\nExperience with Excel, SQL and Python\n\nCompensation for roles at Accenture Federal Services varies depending on a wide array of factors including but not limited to the specific office location, role, skill set and level of experience. As required by local law, Accenture Federal Services provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below and information on benefits offered is here.\n\nRole Location: Range of Starting Pay for role\n\nCalifornia: $67,200 - $117,100\n\nColorado: $67,200 - $101,100\n\nConnecticut: $67,200 - 101,100\n\nNew York City: $77,700 - $117,100\n\nWashington: $71,500 - $107,700\n\n\nWhat We Believe\n\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n\n\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\n\nEqual Employment Opportunity Statement\n\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\n\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\n\n\nRequesting An Accommodation\n\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\n\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\n\nOther Employment Statements\n\n\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: Work life balance is good, work culture is good, people are great, Benefits are good, culture and perks of being in a company seems good\n\t\tCONS: low salary, management are very very poor, Extended working hours, long hours, bad manager\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tIntroduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\n\nIBM Cloud offers a unified platform that gives you cloud computing any way you want it, deployed on demand, with a single pane of glass for systems management (one portal; one Application Programming Interface (API)).\nIBM is currently recruiting for Data Center Specialists to join the Cloud team.\nEssential Duties:\nRack, build, cable, configure, and provision Intel and Advanced Micro Devices (AMD) servers\nRack, cable, and deploy Cisco Layer 2 networking equipment\nTroubleshoot, test, quality assurance of server hardware\nProfessionally resolve hardware issues via trouble ticket\n\n\n\n\nRequired Technical and Professional Expertise\n\nOperating System Installation Windows Server, Linux, Unix\nRack, cable, and deploy Cisco Layer 2 networking equipment a plus\nWeb Server and Database installation experience a plus\nMust be able to work in this country without company sponsorship\nMust be fluent in English\nMust be willing to learn quickly, multi-task, and work in a fast pace environment\nModerate knowledge of PC hardware concepts and component installation\nBasic knowledge of various internet-related services and software (mail, web, DNS, etc)\nGeneral understanding of computer networking concepts\nCustomer focused attitude with some previous customer service experience\nNetwork wiring/cabling experience a plus\n\nPreferred Technical and Professional Expertise\n\n3+ years’ experience with Windows and Linux Platforms\n3+ years’ experience with computer/server hardware\nCertifications are not required but a plus\n\nAbout Business Unit\nDigitization is accelerating the ongoing evolution of business, and clouds - public, private, and hybrid - enable companies to extend their existing infrastructure and integrate across systems. IBM Cloud provides the security, control, and visibility that our clients have come to expect. We are working to provide the right tools and environment to combine all of our client’s data, no matter where it resides, to respond to changing market dynamics.\n\nThis job requires you to provide your COVID-19 vaccination status where legally permissible.\n\nYour Life @ IBM\nWonder if IBM is the one for you? :\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nIBM offers a competitive and comprehensive benefits program. Eligible employees may have access to:\n\n\nHealthcare benefits including medical & prescription drug coverage, dental, vision, and mental health & well being\n- Financial programs such as 401(k), the IBM Employee Stock Purchase Plan, financial counseling, life insurance, short & long- term disability coverage, and opportunities for performance based salary incentive programs\n\nGenerous paid time off including 12 holidays, minimum 56 hours sick time, 120 hours vacation, 12 weeks parental bonding leave in accordance with IBM Policy, and other Paid Care Leave programs. IBM also offers paid family leave benefits to eligible employees where required by applicable law\nTraining and educational resources on our personalized, AI-driven learning platform where IBMers can grow skills and obtain industry-recognized certifications to achieve their career goals\nDiverse and inclusive employee resource groups, giving & volunteer opportunities, and discounts on retail products, services & experiences\n\nThe compensation range and benefits for this position are based on a full-time schedule for a full calendar year. The salary will vary depending on your job-related skills, experience and location. Pay increment and frequency of pay will be in accordance with employment classification and applicable laws. For part time roles, your compensation and benefits will be adjusted to reflect your hours. Benefits may be pro-rated for those who start working during the calendar year.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: work life balance and good, Flexible timings and work from home, people are great, Good benefits, good work culture\n\t\tCONS: Low salary, Poor Management, good manager, low pay, No Salary hike\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tIntroduction\nAs a Hardware Developer at IBM, you’ll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in today’s market.\n\nYour Role and Responsibilities\n\nIBM’s Strategic Research groups at Albany Nanotech are currently seeking an engineer to enable a ground/design rule validation (GRV) - design of experiments (DOE) mission within IBM research for the world's most advanced semiconductor technologies. We are seeking qualified and motivated candidates for a position as a GRV engineer, including GRV content definition and validation.\nThe hired candidate will have experience with electrical engineering, physics, and/or semiconductor characterization. The candidate must understand the fundamental principles of semiconductor processing, electrical testing of semiconductor devices, and/or semiconductor layout design. The candidate will work closely with process integration engineers, litho/patterning/unit process engineers, process assumption/ground rule engineers, layout designers and layout technicians, leading efforts to define the fail mode test structures and analyze the post-tapeout electrical GRV data to feedback to program & ground rules towards GRV validation. The hired candidate must also possess strong analytical and design-of-experiment knowledge, excellent written and verbal communication skills, and the ability to articulate difficult concepts to an audience with diverse technical backgrounds. Experienced candidates will mentor others to improve understanding and quality of processes.\nThe job responsibilities:\n1) Drive Fail Mode and Effect Analysis (FMEA) to pareto key fail modes and Design-Process Risk (DPR) scoring\n2) Design and spec key contents for Device modeling, FEOL/MOL/BEOL HOL/GRV and process kelvins\n3) Drive efficiency improvements & design cycle time reduction with a focused team leveraging synergy and best-of-breed design practices\n4) Analyze electrical GRV data to feedback to program team & ground rules towards GRV validation\n5) Drive & track key process/integration actions & outlooks to address failing ground rules\n6) Report out to stakeholders on GRV maturity to start design\n\n\n\nRequired Technical and Professional Expertise\n\nExperience in Semiconductor Industry (Integration or Patterning or Yield area) at least 1 year\nBasic knowledge of physical layout, technology ground rules, and semiconductor processing\nBasic knowledge of different process fail modes and root cause analysis\nKnowledge of Design of Experiments (DOE)\nSelf-motivated to debug errors and solve problems in a team environment\nExcellent analysis ability and collaboration capability for working with broad teams (must have\nFluent English (both verbal and written) and strong communication skills\n\nPreferred Technical and Professional Expertise\n\nExperience with advanced sub-micron semiconductor technology nodes, at least 1 years\nGood understanding of FMEA analysis concepts and different process fail modes\nExperience with ground/design rules validation or yield analysis, at least 1 year\nExperienced user of Cadence Virtuoso layout design tool\nExperienced user of Synopsys ICV or Calibre DRC checking tools\nExperience with using Pcell to create test structures will be a strong plus\n\n\nAbout Business Unit\nIBM Research is the organic growth engine of IBM and an innovation engine for our customers and partners. As part of this mission, IBM Research anticipates and examines 'What's Next in Computing' to ultimately create and integrate the technologies the world relies upon to solve big challenges and unlock new opportunities. We create and pioneer new markets for IBM, our partners and customers as exemplified in our ongoing quest to reach practical and large-scale quantum computing. Across IBM Research, we realize the power and potential to accelerate discovery with our partners and clients by combining the power of high performance computing, AI, and Quantum, all integrated through the hybrid cloud.\n\nThis job requires you to provide your COVID-19 vaccination status where legally permissible.\n\nYour Life @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nIBM offers a competitive and comprehensive benefits program. Eligible employees may have access to:\n\n\nHealthcare benefits including medical & prescription drug coverage, dental, vision, and mental health & well being\n- Financial programs such as 401(k), the IBM Employee Stock Purchase Plan, financial counseling, life insurance, short & long- term disability coverage, and opportunities for performance based salary incentive programs\n\nGenerous paid time off including 12 holidays, minimum 56 hours sick time, 120 hours vacation, 12 weeks parental bonding leave in accordance with IBM Policy, and other Paid Care Leave programs. IBM also offers paid family leave benefits to eligible employees where required by applicable law\nTraining and educational resources on our personalized, AI-driven learning platform where IBMers can grow skills and obtain industry-recognized certifications to achieve their career goals\nDiverse and inclusive employee resource groups, giving & volunteer opportunities, and discounts on retail products, services & experiences\n\nThe compensation range and benefits for this position are based on a full-time schedule for a full calendar year. The salary will vary depending on your job-related skills, experience and location. Pay increment and frequency of pay will be in accordance with employment classification and applicable laws. For part time roles, your compensation and benefits will be adjusted to reflect your hours. Benefits may be pro-rated for those who start working during the calendar year.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: work life balance and good, Flexible timings and work from home, people are great, Good benefits, good work culture\n\t\tCONS: Low salary, Poor Management, good manager, low pay, No Salary hike\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tIntroduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\n\nStart and end dates for this internship is June 28 and ends August 4.\n\nAs part of an effort to engage with and develop talent, IBM is seeking interns who are interested in a PAID INTERNSHIP where one can not only develop professional skills but also experience IBM culture. Over the course of the internship, Interns will work on projects and mini lessons that increase their technical and professional acumen. Thus preparing them for jobs of the future.\n\nProject/Business areas may include, but not be limited to the following:\n\nData Scientist\nDeveloper\nDesigner\nCorporate Functions in Talent Acquisition & Marketing\nConsulting\n\nRequired Technical and Professional Expertise\n\nLevel 1 P-TECH at IBM Summer Internship Prerequisite Learning completed by April 10, 2023\nMinimum completion of 3 years of P-TECH High School (prior to start)\nMinimum of 3 hours of college credits earned (prior to start)\nCurrent student of one of the IBM affiliated P-TECH schools:\nFalcon Tech (Longmont, Colorado)\nCy-Tech Academy (Baton Rouge, LA)\nJP Navarro HS (Austin, TX)\nNewburgh Free Academy P-TECH (Newburgh, NY)\nP-TECH at Panther (Paterson, NJ)\nP-TECH Brooklyn (Brooklyn, NY)\nP-TECH Carver (Baltimore, MD)\nP-TECH Norwalk (Norwalk, CT)\nSarah E. Goode Academy (Chicago, IL)\nWH Adamson HS (Dallas, TX)\n\n\n\n\nPreferred Technical and Professional Expertise\n\nHS/college attendance 90%+\nGPA: 2.6+\n\nAbout Business Unit\nIBM Corporate Headquarters (CHQ) team represents a variety of functions such as marketing, finance, legal, operations, HR, and more, all working together to solve some of the world's most complex problems, help our clients achieve success and build collaborative work environments for IBMers.\n\nThis job requires you to provide your COVID-19 vaccination status with supporting documentation, where legally permissible.\n\nYour Life @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\nThis job requires you to provide your COVID-19 vaccination status with supporting documentation, where legally permissible.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nSupplemental 1 employees may be eligible for up to 8 paid holidays, minimum of 56 hours paid sick time and the IBM Employee Stock Purchase Plan. IBM offers paid family medical leave and disability benefits to eligible employees where required by applicable law.\n\nThe compensation range and benefits for this position are based on a full-time schedule for a full calendar year. The salary will vary depending on your job-related skills, experience and location. Pay increment and frequency of pay will be in accordance with employment classification and applicable laws. For part time roles, your compensation and benefits will be adjusted to reflect your hours. Benefits may be pro-rated for those who start working during the calendar year.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: work life balance and good, Flexible timings and work from home, people are great, Good benefits, good work culture\n\t\tCONS: Low salary, Poor Management, good manager, low pay, No Salary hike\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tIntroduction\nSystem Services Representatives are the primary technical interface to clients for the coordination of hardware and software support and delivery of operational services. Sound pretty important? Absolutely! You will advise clients of preventive maintenance, configuration, operation and environmental factors which may drastically impact product performance or impair the client's IT operation.\n\nYour Role and Responsibilities\nIBM seeks to hire a Systems Services Representative for the Indianapolis, IN area. This role is for an individual contributor responsible for on-site installation, maintenance, and repair of IBM and multi-vendor systems and components, including hardware, networking products, software, and operating systems in a data center environment. They could be responsible for Intel Server, Networking, and Storage. They are the primary technical interface to clients for the coordination of hardware and/or software support and delivery of operational services as required by the client. They advise clients of preventive maintenance, configuration, operation, and environmental factors that may impact product performance or impair the client's IT operation. They may also perform services activities such as systems assurance, systems-level problem determination, discontinuance, and relocation of IBM and non-IBM systems and products. They are accountable to ensure a high level of client satisfaction with service delivery, technical support, and operational services for the client account(s). When critical situations occur, they are the IBM technical interface to clients and manage the situation until they are fixed.\n\nRequired Technical and Professional Expertise\n\nValid driver’s license\nReliable vehicle\nTechnical aptitude\nHigh school diploma or equivalent\n1+ years of exp\n\n\nPreferred Technical and Professional Expertise\n\nTechnical school degree/diploma\nExperience in hardware support of IBM and/or OEM Servers, Networking, switches, and routers or equivalent\n\nAbout Business Unit\nIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world’s most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n\nThis job requires you to provide your COVID-19 vaccination status with supporting documentation, where legally permissible.\n\nYour Life @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nIBM offers a competitive benefits program which may include medical & prescription drug coverage, dental, vision, mental health & well being, 8 paid holidays, minimum 56 hours paid sick time, 80 hours paid vacation, life insurance, 401(k), financial counseling, and the IBM Employee Stock Purchase Plan. IBM offers paid family medical leave and disability benefits to eligible employees where required by applicable law.\n\nThe compensation range and benefits for this position are based on a full-time schedule for a full calendar year. The salary will vary depending on your job-related skills, experience and location. Pay increment and frequency of pay will be in accordance with employment classification and applicable laws. For part time roles, your compensation and benefits will be adjusted to reflect your hours. Benefits may be pro-rated for those who start working during the calendar year.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: work life balance and good, Flexible timings and work from home, people are great, Good benefits, good work culture\n\t\tCONS: Low salary, Poor Management, good manager, low pay, No Salary hike\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tIntroduction\nA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.\n\nYou'll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.\n\nCuriosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you'll be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.\n\nYour Role and Responsibilities\nAs an SAP Quality Assurance/Test Consultant you will serve as a client-facing practitioner who sells, leads and implements expert services utilizing the breadth of IBM's offerings and technologies. A successful Consultant is regarded by clients as a trusted business advisor who collaborates to provide innovative solutions used to solve the most challenging business problems.\n\nYou will work on projects that help clients integrate strategy, process, technology, and information to increase effectiveness, reduce costs and improve profit and shareholder value. You can take advantage of opportunities to master new skills, work across different disciplines, move into new challenges and develop a robust understanding of different industries.\n\nYour primary responsibilities include:\nExecute regression test scripts within a Quality Assurance (QA) environment in a manual and automatic fashion to support scheduled and unscheduled releases\nRecord test results within the applicable test tracking tool\nReview and load test plans into test tracking tool to validate functionality and requirements\nReview design and technical packages to ensure quality and the proper processes are followed\nManage / Coordinate regression test events with program stakeholders\nDevelop / Update / Maintain automated test scripts based on test plans submitted by the systems integrators\nPerform upgrade / maintenance tasks of a test tracking tool\nPerform analysis of, document, report, escalate, triage and resolve issues / defects / bugs found during regression testing\nProvide testing metrics to show progress of each regression test event\nCreate, update, and maintain test strategy, standard operating procedures, processes, policies, etc. surrounding regression test\nUtilize WorkSoft technology to execute automated test scripts (CBTs)\n\nRequired Technical and Professional Expertise\n\nAt least 5 years of SAP experience\nExperience in WorkSoft technology\nSubject Matter Expert (SME) experience in one or more SAP functional/module area\nAbility to evaluate performance results and recommend major changes affecting short-term project growth and success\nTechnical expert across multiple project assignments\nExperience in software development lifecycle surrounding requirements gathering, analysis, design, development, documentation, test (unit, functional, integration, regression, stress, and user acceptance), implementation, and post-production support of standard and custom business solutions supporting various SAP modules, such as ECC, BW, SCM, SRM in a Tier 3 environment\nAbility to earn a DoD Secret clearance\n\nPreferred Technical and Professional Expertise\n\nUS Navy project experience\nDoD project experience\n\nAbout Business Unit\nIBM Consulting is IBM’s consulting and global professional services business, with market leading capabilities in business and technology transformation. With deep expertise in many industries, we offer strategy, experience, technology, and operations services to many of the most innovative and valuable companies in the world. Our people are focused on accelerating our clients’ businesses through the power of collaboration. We believe in the power of technology responsibly used to help people, partners and the planet.\n\nThis job requires you to provide your COVID-19 vaccination status where legally permissible.\n\nYour Life @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nIBM offers a competitive and comprehensive benefits program. Eligible employees may have access to:\n\n\nHealthcare benefits including medical & prescription drug coverage, dental, vision, and mental health & well being\n- Financial programs such as 401(k), the IBM Employee Stock Purchase Plan, financial counseling, life insurance, short & long- term disability coverage, and opportunities for performance based salary incentive programs\n\nGenerous paid time off including 12 holidays, minimum 56 hours sick time, 120 hours vacation, 12 weeks parental bonding leave in accordance with IBM Policy, and other Paid Care Leave programs. IBM also offers paid family leave benefits to eligible employees where required by applicable law\nTraining and educational resources on our personalized, AI-driven learning platform where IBMers can grow skills and obtain industry-recognized certifications to achieve their career goals\nDiverse and inclusive employee resource groups, giving & volunteer opportunities, and discounts on retail products, services & experiences\n\nThe compensation range and benefits for this position are based on a full-time schedule for a full calendar year. The salary will vary depending on your job-related skills, experience and location. Pay increment and frequency of pay will be in accordance with employment classification and applicable laws. For part time roles, your compensation and benefits will be adjusted to reflect your hours. Benefits may be pro-rated for those who start working during the calendar year.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: work life balance and good, Flexible timings and work from home, people are great, Good benefits, good work culture\n\t\tCONS: Low salary, Poor Management, good manager, low pay, No Salary hike\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day and we need you as a Data Center Technician I (DCT).\n\nMicrosoft’s Cloud Operations & Innovation (CO+I) is the engine that powers our cloud services. As a Data Center Technician I, you will perform a key role in delivering the core infrastructure and foundational technologies for Microsoft's online services including Bing, Office 365, Xbox, OneDrive, and the Microsoft Azure platform. As a group, CO+I is focused on the personal and professional development for all employees and offers trainings and growth opportunities including Career Rotation Programs, Diversity & Inclusion trainings and events, and professional certifications.\n\nOur infrastructure is comprised of a large global portfolio of more than 100 data centers and 1 million servers. Our foundation is built upon and managed by a team of subject matter experts working to support services for more than 1 billion customers and 20 million businesses in over 90 countries worldwide.\n\nWith environmental sustainability and optimization at the forefront of our data center design and operations, we continue to grow and evolve as we meet the ever-changing business demands that hold Microsoft as a world-class cloud provider.\n\nDo you want to empower billions across the world? Come and join us in CO+I and be at the forefront of the action!\n\nBy applying to this role, you’ll be assessed for multiple positions on several teams.\nResponsibilities\nAs a Data Center Technician I, your responsibilities will include:\n\n\nData Center Operations\nReceives guidance and supervision to develop an understanding of standard processes and procedures for preparing, installing, performing diagnostics, troubleshooting, replacing, and/or decommissioning equipment; develops and acquires a fundamental understanding of the functions of, and interactions between network and server equipment.\nDemonstrates awareness that changes to their area impact the work of others; asks questions when they do not have required information and may provide feedback on changes to processes to management.\nComplies with Data Center Services (DCS) business unit and service-level policies, procedures, and deadlines with guidance from other technicians; escalates resolution of compliance issues to technician leads.\nCompletes assigned tickets efficiently and in alignment with Key Performance Indicators (KPIs) per task type while meeting established Service Level Agreements (SLAs), with guidance from other technicians; appropriately escalates tickets to more experienced technicians.\nService Delivery\nPrepares, stages, sets up, and performs basic startups and shutdowns for hardware (e.g., racks, hard drives, switches) according to specifically written instructions provided via checklists, guides, standard protocols, emails, guidance from other technicians, and/or direction from management; escalates resolution of challenging or complex tasks to others as needed to meet Service Level Agreements (SLAs) and may perform tasks in tandem with other technicians to comply with procedures and safety protocols.\nPerforms basic diagnostics and troubleshooting with guidance from experienced technicians and by following standard procedures to identify the cause(s) of issues and replace faulty components with minimal customer and business disruption; escalates troubleshooting complex issues appropriately.\nFollows procedures to communicate, report, and escalate incidents to appropriate Microsoft data center operations management units and Technician Leads.\nDecommissions hardware for simple changes and refreshes (e.g., memory upgrades, OS rebuilds) following standard procedures seeks clarification and guidance from more experienced technicians as needed; escalates complex decommissioning work and discrepancies in projects or tickets to lead technicians when appropriate; processes data-bearing devices for destruction or confirms any data contained have been eradicated.\nManaging Services\nContributes to issue tracking through escalations by asking questions and seeking guidance on timely resolution of issues from more experienced technicians.\nDevelops an understanding of cross-functional processes to support partnerships with internal and external stakeholders.\nCompletes required training aligned to the role and workload; observes more experienced technicians to gain hands-on experience and relevant on-the-job training (OJT); may complete additional training to obtain or maintain relevant role certifications.\nData Center Work Environment\nParticipates in daily safety briefings, completes required safety training, complies with safety procedures (e.g., equipment use, lifting, electrical hazards, ladder/rolling stair use), completes required Task Hazard Analysis (THAs), and uses appropriate tools and Personal Protective Equipment (PPE) for assigned tasks; adheres to and promotes a culture of safety, takes action and alerts others to safety concerns and/or incidents; participates in Get Out And Look (GOAL) safety observations.\nComplies with security and data management procedures and policies with guidance from other technicians, and completes required security training; may escort third party vendors or IT support on-premises at data centers or network sites; appropriately takes action and alerts others to security concerns and/or incidents.\nContributes to a positive and effective team environment by sharing information with others, contributing in regular team meetings, asking questions and staying apprised of the status of others' work, and partnering with other technicians to complete and/or hand off tickets as needed; responds to feedback received on ways to work more effectively within their team and adopts best practices shared within and across technician teams.\nOwnership\nHas pride and a sense of accountability for the service quality, completeness, and resulting user experience; displays accountability and ownership of the data center facilities.\nMaintains a client focus to understand the impact of their work when completing tickets and assigned tasks.\nOther\nEmbody our culture and values\nQualifications\nRequired Qualifications\nHigh school diploma, GED, or equivalent and basic knowledge of computer hardware and components.\n\nThe ability to work 12 hours shifts, including shift assignments during non-standard business hours that may include evening, nighttime, weekends, and/or holidays.\n\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nCitizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local United States government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport.\nData Center Technicians ATR-B - The typical base pay range for this role across the U.S. is USD $20.50 - $32.40 per hour. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $27.00 - $34.80 per hour.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n#COICareers\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\nShow More \nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: great benefits, Work/Life balance is good, great people, Great Culture, pay is good\n\t\tCONS: Bad managers, poor management, Long hours, Too much politics, Bad middle management\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tHave you ever wondered what it would be like to help protect over a billion users across the planet? Are you excited about cybersecurity? Do you want to join a team that will move the needle on security problems?\n\n\nOur team's mission is to protect our customers from the perils and attacks they face as they engage in the online world. The team’s charter is to protect Microsoft 365, the world’s largest productivity service and its principal data store. We continually take inputs from bug bounty, internal penetration test and external customer feedback to keep our customer's data secure. We are tasked with keeping up and exceeding the pace of innovation that is happening around the world.\n\nThe Substrate Green Team is responsible for building security strategy, writing prototype and proof-of-concept code, working with teams to evangelize secure patterns, and driving architectural changes into the product to improve security outcomes at the scale of M365.\n\nWe are looking for a Software Engineer to join us. This is a great opportunity for you to help us build security features and innovative product.\nResponsibilities\nImprove application security maturity at scale by designing, implementing, and building security solutions.\nPartner with product managers and senior security leaders to ensure security maturity work is being prioritized and addressed across Microsoft 365 services.\nBuilding prototypes and proof-of-concept code, working alongside the engineering teams to provide advice on secure design and implementation.\nProviding design guidance and security reviews to engineering teams and improve security maturity.\nQualifications\nRequired/Minimum Qualifications\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n\nAdditional Or Preferred Qualifications\n\nExperience building and shipping production grade software or services.\nExperience in conducting threat model assessment of infrastructure and services.\nHave a deep desire to work collaboratively, solve problems with groups, find win/win solutions and celebrate successes.\nUnderstanding of data structures and algorithms\nExperience with distributed services.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n#MSFTSecurity\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\nShow More \nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: great benefits, Work/Life balance is good, great people, Great Culture, pay is good\n\t\tCONS: Bad managers, poor management, Long hours, Too much politics, Bad middle management\n\t","\n\t\t[JOB-VETTER-JOB-DESCRIPTION]\n\t\tThe Microsoft Applied Sciences Group incubates disruptive technologies for Microsoft’s next-gen Windows and Device products and is working on several exciting projects that will shape how computers and other devices perceive the user and the user’s environment. Operating as a startup within the company, this team works closely with several research and product teams to bring compelling new experiences to the market. A lot of these experiences will be powered by signal processing and computer vision – and as part of this team, you will have the unique opportunity to work on almost every aspect of a shipping vision system: screen rendering, camera optics, sensors, data pipeline and of course, developing and implementing the algorithms that make magic happen!\n\nThe Applied Sciences Group is growing, and we have an exciting opportunity for a talented Research Software Development Engineer to develop algorithms and efficient implementations for specific and general-purpose silicon on next generation devices and operating systems. This is a hands-on tech lead role that will have collaboration opportunities throughout the organization. The Research Software Development Engineer will be building new stuff that really works, and delivering it to millions of users worldwide.\nResponsibilities\nCollaborate with researchers and product development teams\nDesign and implement highly efficient algorithms\nMeasure, analyze and diagnose system performance.\nQualifications\nRequired/Minimum Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n\nAdditional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience with low level programming using C/C++\nIndustry experience with image processing or other numerical programming\nExperience with SIMD (NEON, SVE, SSE, AVX, HVX), shaders or ASM programming\nExperience with multi-threading\n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\nShow More \nReport\n\t\t[JOB-VETTER-JOB-LABELS]\n\t\tPROS: great benefits, Work/Life balance is good, great people, Great Culture, pay is good\n\t\tCONS: Bad managers, poor management, Long hours, Too much politics, Bad middle management\n\t"]